OpenFOAM-2.3.1/tutorials/multiphase/interFoam/ras/damBreakPorousBaffle/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh
runApplication setFields

runApplication createBaffles -overwrite

runApplication $application

# ----------------------------------------------------------------- end-of-file
